<?php

return array(

    /*
    |--------------------------------------------------------------------------
    | Statuses Language Lines
    |--------------------------------------------------------------------------
    |
    | Mostly used to return the success status of some operation.
    |
    */

    'orbit' => array(
        'deleted'   => array(
            'user'           => 'ユーザーが正常に削除されました.',
            'merchant'       => 'マーチャントは正常に削除されました.',
            'retailer'       => '小売業者は、正常に削除されました.',
            'product'        => '製品が正常に削除されました.',
            'category'       => 'カテゴリーは、正常に削除されました.',
            'promotion'      => '推進が正常に削除されました.',
            'coupon'         => 'クーポンは正常に削除されました.',
            'issued_coupon'  => '発行クーポンが正常に削除されました.',
            'event'          => 'イベントが正常に削除されました.',
            'lucky_draw'     => 'ラッキードローが正常に削除されました.',
            'news'           => 'ニュースは正常に削除されました.',
            'object'         => 'オブジェクトが正常に削除されました.',
        ),
        'updated'   => array(
            'user'           => 'ユーザーが正常に更新されました',
            'your_password'  => 'あなたのパスワードは更新に成功してきました.',
            'serviceagreement'  => 'Service Agreement has been successfully updated.',
        ),
        'nodata'    => array(
            'user'          => '検索条件に一致するユーザはいません.',
            'merchant'      => '検索条件に一致した何商人はありません.',
            'retailer'      => '検索条件に一致した何小売業者はありません.',
            'product'       => '検索条件に一致する何の製品がありません.',
            'tax'           => '検索条件に一致した租税はありません.',
            'categories'    => '検索条件に一致した全くカテゴリはありません.',
            'promotion'     => '検索条件に一致した全く昇進はありません.',
            'coupon'        => '検索条件に一致した何クーポンはありません.',
            'issued_coupon' => '検索条件に一致した全く発行されたクーポンはありません.',
            'event'         => '検索条件に一致するイベントなしはありません.',
            'attribute'     => '検索条件にマッチした商品の属性がありません.',
            'widget'        => '検索条件に一致した全くウィジェットはありません.',
            'city'          => '検索条件に一致した全く都市はありません.',
            'setting'       => '検索条件に一致する設定はここにはありません.',
            'country'       => '検索条件に一致したどの国はありません.',
            'pos_quick_product' => '検索条件に一致した全くPOS迅速な製品がありません.',
            'personalinterest' => '検索条件に一致しない個人的な利害関係はありません.',
            'role'          => '検索条件に一致した何の役割はありません.',
            'token'         => '検索条件に一致した全くトークンはありません.',
            'lucky_draw'    => '検索条件に一致した何抽選はありません.',
            'lucky_draw_number_receipt' => '検索条件に一致した全く抽選番号の領収書はありません.',
            'lucky_draw_number' => '検索条件に一致した全く抽選番号はありません.',
            'news'          => '検索条件に一致ないニュースはありません.',
            'object'        => '検索条件に一致した全くオブジェクトはありません.',
            'activity'      => '検索条件に一致するアクティビティはありません.',
        ),
        'uploaded'  => array(
            'merchant' => array(
                'logo'          => 'マーチャントのロゴが正常にアップロードされました',
                'delete_logo'   => 'マーチャントのロゴが正常に削除されました.'
            ),
            'retailer' => array(
                'logo'  => '小売業者のロゴが正常にアップロードされました.',
            ),
            'mall' => array(
                'background'         => '背景画像が正常にアップロードされました.',
                'delete_background'  => '背景画像が正常に削除されました.'
            ),
            'product' => array(
                'main'          => '商品画像は正常にアップロードされました.',
                'delete_image'  => '商品画像は正常に削除されました.'
            ),
            'promotion' => array(
                'main'          => 'プロモーション画像が正常にアップロードされました.',
                'delete_image'  => 'プロモーション画像が正常に削除されました.'
            ),
            'coupon' => array(
                'main'          => 'クーポン画像が正常にアップロードされました.',
                'delete_image'  => 'クーポン画像が正常に削除されました.'
            ),
            'event' => array(
                'main'          => 'イベントイメージが正常にアップロードされました.',
                'delete_image'  => 'イベントイメージが正常に削除されました.'
            ),
            'user' => array(
                'profile_picture'           => 'プロフィール画像が正常にアップロードされました.',
                'profile_picture_deleted'   => 'プロフィール画像が正常に削除されました.'
            ),
            'widget' => array(
                'main'           => 'ウィジェットイメージが正常にアップロードされました.',
                'delete_image'   => 'ウィジェットイメージが正常に削除されました.'
            ),
            'lucky_draw' => array(
                'main'          => 'ラッキードローイメージが正常にアップロードされました.',
                'delete_image'  => 'ラッキードローイメージが正常に削除されました.'
            ),
            'news' => array(
                'main'          => 'ニュース画像が正常にアップロードされました.',
                'delete_image'  => 'ニュース画像が正常に削除されました.'
            ),
        )
    )
);
